'''
Дано ціле число N, яке користувач заповнює з клавіатури, для цього числа необхідно зробити такі перевірки:

Якщо N непарне число, виведіть на екран "Weird"
Якщо N парне число і входить у діапазон від 2 до 5 (включно), виведіть "Not Weird"
Якщо N парне число і входить у діапазон від 6 до 20 (включно), виведіть "Weird"
Якщо N непарне число і більше 20, виведіть "Not Weird"
'''
n = int(input('Введить ціле число N-'))
if n % 2 != 0:
    print('Weird')
if n % 2 == 0 and 2 <= n <= 5:
    print('Not Weird')
if n % 2 == 0 and 6 <= n <= 20:
    print('Weird')
if n % 2 != 0 and n > 20:
    print('Not Weird')
